tak-tests/tak-performance/src/test/resources/data/GetLogicalAddressessByServiceContract_5565594230_ProcessNotification_Mock.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:infrastructure:itintegration:registry:2" xmlns:urn1="urn:riv:infrastructure:itintegration:registry:GetLogicalAddresseesByServiceContractResponder:2">
   <soapenv:Header>
      <urn:LogicalAddress>?</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:GetLogicalAddresseesByServiceContract>
         <urn1:serviceConsumerHsaId>5565594230</urn1:serviceConsumerHsaId>
         <urn1:serviceContractNameSpace>
            <urn:ServiceContractNamespace>urn:riv:itintegration:engagementindex:ProcessNotificationResponder:1</urn:ServiceContractNamespace>
            <!--You may enter ANY elements at this point-->
         </urn1:serviceContractNameSpace>
         <!--You may enter ANY elements at this point-->
      </urn1:GetLogicalAddresseesByServiceContract>
   </soapenv:Body>
</soapenv:Envelope>